### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_monitor_scheduled_query_rules_alert_v2.service-bus-logout-events-emission-failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "service-bus-logout-events-emission-failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "Failure(s) detected on ServiceBus Authentication Event emission. See https://pagopa.atlassian.net/wiki/spaces/IAEI/pages/1859846279/Fallimento+emissione+evento+di+Log-Out"
      + enabled                                = true
      + evaluation_frequency                   = "PT15M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[AUTH] ServiceBus Log-Out Event(s) emission failure(s)"
      + resource_group_name                    = "io-p-itn-auth-main-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Insights/components/io-p-ai-common",
        ]
      + severity                               = 1
      + tags                                   = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Auth&Identity"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-common-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-auth-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                customEvents
                | where name == "service-bus.auth-event.emission-failure"
                | extend eventData = parse_json(tostring(customDimensions.eventData))
                | where eventData.eventType == "logout""
            EOT
          + threshold               = 0
          + time_aggregation_method = "Count"

          + failing_periods {
              + minimum_failing_periods_to_trigger_alert = 1
              + number_of_evaluation_periods             = 1
            }
        }
    }

  # module.function_profile_async.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          ~ "SPID_LOGS_PUBLIC_KEY"                                                                             = (sensitive value)
            # (53 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02"
        name                                           = "io-p-itn-auth-profas-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_profile_async.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "SPID_LOGS_PUBLIC_KEY"                                                                             = (sensitive value)
            # (54 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-itn-auth-profas-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "0.3.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>
